load-test.yml
config:
  target: "http://localhost:3010"
  phases:
    - duration: 60  
      arrivalRate: 500
  defaults:
    headers:
      Authorization: "Bearer eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpZCI6IjA1YmJiN2JkLTJjNzktNDJlMy1iNTM2LWEzNzViNTgxNmViZSIsImlhdCI6MTc2ODUxNTE4NiwiZXhwIjoxNzY4NTIyMzg2fQ.eQbhNyFOotDpy5n17n6mmtZN7aOfsyHEaCK9ml3_WDI"

scenarios:
  - flow:
      - get:
          url: "/api/docs"